Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/sam4lc2a.h
/*
 * \brief Configuration of the Cortex-M4 Processor and Core Peripherals
 */

#define LITTLE_ENDIAN          1
#define __BB_PRESENT           0         /*!< BIT_BANDING present or not */
#define __CLKGATE_PRESENT      1         /*!< CLKGATE present or not */
#define __CM4_REV              1         /*!< Core revision r0p1 */
#define __DEBUG_LVL            3         /*!< Full debug plus DWT data matching */
#define __FPU_PRESENT          0         /*!< FPU present or not */
#define __JTAG_PRESENT         1         /*!< JTAG present or not */
#define __MPU_PRESENT          1         /*!< MPU present or not */
#define __NVIC_PRIO_BITS       4         /*!< Number of bits used for Priority Levels */
#define __TRACE_LVL            1         /*!< Standard trace: ITM and DWT triggers and counters, but no ETM */
#define __Vendor_SysTickConfig 0         /*!< Set to 1 if different SysTick Config is used */
#define __WIC_PRESENT          0         /*!< WIC present or not */

/**
 * \brief CMSIS includes
 */

#include <core_cm4.h>
#if !defined DONT_USE_CMSIS_INIT
#include "system_sam4l.h"
#endif /* DONT_USE_CMSIS_INIT */

/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAM4LC2A */
/* ************************************************************************** */
/** \addtogroup SAM4LC2A_api Peripheral Software API */
/*@{*/

#include "component/component_abdacb.h"
#include "component/component_acifc.h"
#include "component/component_adcife.h"
#include "component/component_aesa.h"
#include "component/component_ast.h"
#include "component/component_bpm.h"
#include "component/component_bscif.h"
#include "component/component_catb.h"
#include "component/component_chipid.h"
#include "component/component_crccu.h"
#include "component/component_dacc.h"
#include "component/component_eic.h"
#include "component/component_flashcalw.h"
#include "component/component_freqm.h"
#include "component/component_gloc.h"
#include "component/component_gpio.h"
#include "component/component_hcache.h"
#include "component/component_hmatrixb.h"
#include "component/component_iisc.h"
#include "component/component_lcdca.h"
#include "component/component_parc.h"
#include "component/component_pdca.h"
#include "component/component_pevc.h"
#include "component/component_picouart.h"
#include "component/component_pm.h"
#include "component/component_scif.h"
#include "component/component_smap.h"
#include "component/component_spi.h"
#include "component/component_tc.h"
#include "component/component_trng.h"
#include "component/component_twim.h"
#include "component/component_twis.h"
#include "component/component_usart.h"
#include "component/component_usbc.h"
#include "component/component_wdt.h"
/*@}*/

/* ************************************************************************** */
/**  REGISTERS ACCESS DEFINITIONS FOR SAM4LC2A */
/* ************************************************************************** */
/** \addtogroup SAM4LC2A_reg Registers Access Definitions */
/*@{*/

#include "instance/instance_abdacb.h"
#include "instance/instance_acifc.h"
#include "instance/instance_adcife.h"
#include "instance/instance_aesa.h"
#include "instance/instance_ast.h"
#include "instance/instance_bpm.h"
#include "instance/instance_bscif.h"
#include "instance/instance_catb.h"
#include "instance/instance_chipid.h"
#include "instance/instance_crccu.h"
#include "instance/instance_dacc.h"
#include "instance/instance_eic.h"
#include "instance/instance_hflashc.h"
#include "instance/instance_freqm.h"
#include "instance/instance_gloc.h"
#include "instance/instance_gpio.h"
#include "instance/instance_hcache.h"
#include "instance/instance_hmatrix.h"
#include "instance/instance_iisc.h"
#include "instance/instance_lcdca.h"
#include "instance/instance_parc.h"
#include "instance/instance_pdca.h"
#include "instance/instance_pevc.h"
#include "instance/instance_picouart.h"
#include "instance/instance_pm.h"
#include "instance/instance_scif.h"
#include "instance/instance_smap.h"
#include "instance/instance_spi.h"
#include "instance/instance_tc0.h"
#include "instance/instance_tc1.h"
#include "instance/instance_trng.h"
#include "instance/instance_twim0.h"
#include "instance/instance_twim1.h"
#include "instance/instance_twim2.h"
#include "instance/instance_twim3.h"
#include "instance/instance_twis0.h"
#include "instance/instance_twis1.h"
#include "instance/instance_usart0.h"
#include "instance/instance_usart1.h"
#include "instance/instance_usart2.h"
#include "instance/instance_usart3.h"
#include "instance/instance_usbc.h"
#include "instance/instance_wdt.h"
/*@}*/

/* ************************************************************************** */
/**  PERIPHERAL ID DEFINITIONS FOR SAM4LC2A */
/* ************************************************************************** */
/** \addtogroup SAM4LC2A_id Peripheral Ids Definitions */
/*@{*/

// Peripheral instances on HTOP0 bridge
#define ID_IISC           0 /**< \brief Inter-IC Sound (I2S) Controller (IISC) */
#define ID_SPI            1 /**< \brief Serial Peripheral Interface (SPI) */
#define ID_TC0            2 /**< \brief Timer/Counter TC (TC0) */
#define ID_TC1            3 /**< \brief Timer/Counter TC (TC1) */
#define ID_TWIM0          4 /**< \brief Two-wire Master Interface TWIM (TWIM0) */
#define ID_TWIS0          5 /**< \brief Two-wire Slave Interface TWIS (TWIS0) */
#define ID_TWIM1          6 /**< \brief Two-wire Master Interface TWIM (TWIM1) */
#define ID_TWIS1          7 /**< \brief Two-wire Slave Interface TWIS (TWIS1) */
#define ID_USART0         8 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART0) */
#define ID_USART1         9 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART1) */
#define ID_USART2        10 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART2) */
#define ID_USART3        11 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART3) */
#define ID_ADCIFE        12 /**< \brief ADC controller interface (ADCIFE) */
#define ID_DACC          13 /**< \brief DAC Controller (DACC) */
#define ID_ACIFC         14 /**< \brief Analog Comparator Interface (ACIFC) */
#define ID_GLOC          15 /**< \brief Glue Logic Controller (GLOC) */
#define ID_ABDACB        16 /**< \brief Audio Bitstream DAC (ABDACB) */
#define ID_TRNG          17 /**< \brief True Random Number Generator (TRNG) */
#define ID_PARC          18 /**< \brief Parallel Capture (PARC) */
#define ID_CATB          19 /**< \brief Capacitive Touch Module B (CATB) */
#define ID_TWIM2         20 /**< \brief Two-wire Master Interface TWIM (TWIM2) */
#define ID_TWIM3         21 /**< \brief Two-wire Master Interface TWIM (TWIM3) */
#define ID_LCDCA         22 /**< \brief LCD Controller (LCDCA) */

// Peripheral instances on HTOP1 bridge
#define ID_HFLASHC       32 /**< \brief Flash Controller (HFLASHC) */
#define ID_HCACHE        33 /**< \brief Cortex M I&D Cache Controller (HCACHE) */
#define ID_HMATRIX       34 /**< \brief HSB Matrix (HMATRIX) */
#define ID_PDCA          35 /**< \brief Peripheral DMA Controller (PDCA) */
#define ID_SMAP          36 /**< \brief System Manager Access Port (SMAP) */
#define ID_CRCCU         37 /**< \brief CRC Calculation Unit (CRCCU) */
#define ID_USBC          38 /**< \brief USB 2.0 Interface (USBC) */
#define ID_PEVC          39 /**< \brief Peripheral Event Controller (PEVC) */

